warning('off', 'Octave:missing-FcInit');

fprintf("[*] Решение СЛАУ методом Жоржана-Гаусса\n");
fprintf("[*] Система №1:\n");

A = [5.64, -4.52, 4.57;
    -2.17, 1.36, -5.53;
    8.77, -2.78, 5.44];

B = [8.32; 7.21; 7.56];

n = size([A, B], 1);

X = gauss(A, B, n)

X = jourdan(A, B, n)

fprintf("[*] Система №2:\n");

A = [2.34, -1.84, 0.32, 0.11;
    -1.19, 0.43, -0.52, 3.37;
    0.33, 0.61, 7.75, -2.18;
    -1.53, 0.81, 0.94, -4.82];

B =[2.22; -5.26; 0.15; -3.74];

n = size([A, B], 1);

X = gauss(A, B, n)

X = jourdan(A, B, n)

